# Flask本格入門　list 2.8
from flask import Flask

# ===========================================
# インスタンス作成
# ===========================================
app = Flask(__name__)

# ===========================================
# ルーティング
# ===========================================
# TOPページ
@app.route('/')
def index():
    return '<h1>TOPページ</h1>'

# 一覧
@app.route('/list')
def item_list():
    return '<h1>商品一覧ページ</h1>'

# 詳細
@app.route('/detail')
def item_detail():
    return '<h1>商品詳細ページ</h1>'

# ===========================================
# アプリの起動
# ===========================================
if __name__ == '__main__':
    app.run(debug=True)
